In [ ]:
# View/Inspecting Data:

In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['A', 'B', 'C', 'D', 'E','F', 'G', 'H', 'I', 'J'],
    'Age': [24, 27, 22, 32, 28,24, 27, 22, 32, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix','New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Score': [88.5, 92.3, 79.5, 95.1, 85.0,88.5, 92.3, 79.5, 95.1, 85.0]
}
print(data)

{'Name': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], 'Age': [24, 27, 22, 32, 28, 24, 27, 22, 32, 28], 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'], 'Score': [88.5, 92.3, 79.5, 95.1, 85.0, 88.5, 92.3, 79.5, 95.1, 85.0]}

In [4]:
df = pd.DataFrame(data)
print(df)

  Name  Age         City  Score
0    A   24     New York   88.5
1    B   27  Los Angeles   92.3
2    C   22      Chicago   79.5
3    D   32      Houston   95.1
4    E   28      Phoenix   85.0
5    F   24     New York   88.5
6    G   27  Los Angeles   92.3
7    H   22      Chicago   79.5
8    I   32      Houston   95.1
9    J   28      Phoenix   85.0

In [5]:
print(df.head())  # default first 5  rows of the DataFrame

  Name  Age         City  Score
0    A   24     New York   88.5
1    B   27  Los Angeles   92.3
2    C   22      Chicago   79.5
3    D   32      Houston   95.1
4    E   28      Phoenix   85.0

In [6]:
print(df.head(3))  # First 3 rows of the DataFrame

  Name  Age         City  Score
0    A   24     New York   88.5
1    B   27  Los Angeles   92.3
2    C   22      Chicago   79.5

In [7]:
print(df.tail()) # default last 5 rows of the Dataframe

  Name  Age         City  Score
5    F   24     New York   88.5
6    G   27  Los Angeles   92.3
7    H   22      Chicago   79.5
8    I   32      Houston   95.1
9    J   28      Phoenix   85.0

In [8]:
print(df.shape) #represent tuple(no_of_row, no_of_column)

(10, 4)

In [9]:
print(df.info()) #info of dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   City    10 non-null     object
 3   Score   10 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes
None

In [10]:
print(df.describe())  # Summary statistics for numerical columns

             Age      Score
count  10.000000  10.000000
mean   26.600000  88.080000
std     3.627059   5.780581
min    22.000000  79.500000
25%    24.000000  85.000000
50%    27.000000  88.500000
75%    28.000000  92.300000
max    32.000000  95.100000

In [11]:
print(df['City'].value_counts(dropna=True)) #count value how many time used

City
New York       2
Los Angeles    2
Chicago        2
Houston        2
Phoenix        2
Name: count, dtype: int64

In [15]:
print(df.value_counts()) #counts all values how many time used

Name  Age  City         Score
A     24   New York     88.5     1
B     27   Los Angeles  92.3     1
C     22   Chicago      79.5     1
D     32   Houston      95.1     1
E     28   Phoenix      85.0     1
F     24   New York     88.5     1
G     27   Los Angeles  92.3     1
H     22   Chicago      79.5     1
I     32   Houston      95.1     1
J     28   Phoenix      85.0     1
Name: count, dtype: int64

In [18]:
df['City']  #access column using name

0       New York
1    Los Angeles
2        Chicago
3        Houston
4        Phoenix
5       New York
6    Los Angeles
7        Chicago
8        Houston
9        Phoenix
Name: City, dtype: object

In [20]:
df[['Name','City']] #access coulmns using names

  Name         City
0    A     New York
1    B  Los Angeles
2    C      Chicago
3    D      Houston
4    E      Phoenix
5    F     New York
6    G  Los Angeles
7    H      Chicago
8    I      Houston
9    J      Phoenix

In [39]:
print(df['Name'].iloc[0:9:2])   #access coulmn using iloc

0    A
2    C
4    E
6    G
8    I
Name: Name, dtype: object

In [37]:
print(df['Name'].iloc[5])

F

In [34]:
df

  Name  Age         City  Score
0    A   24     New York   88.5
1    B   27  Los Angeles   92.3
2    C   22      Chicago   79.5
3    D   32      Houston   95.1
4    E   28      Phoenix   85.0
5    F   24     New York   88.5
6    G   27  Los Angeles   92.3
7    H   22      Chicago   79.5
8    I   32      Houston   95.1
9    J   28      Phoenix   85.0

In [36]:
print(df.iloc[5,2])

New York

In [54]:
df.iloc[0:1]

  Name  Age      City  Score
0    A   24  New York   88.5